[
  {
    "model": "mcda.Problem",
    "pk": 1,
    "fields": {
      "name": "Laptop do pracy",
      "description": "<p>Właśnie zepsuł się twój laptop, który wykorzystywałeś/aś do pracy na studiach. Wycena naprawy przez serwis przewyższyła wartość sprzętu, zatem postanawiasz zrezygnować z naprawy, a pieniądze przeznaczyć na zakup nowego laptopa. Po wstępnej selekcji obszar poszukiwań został zawężony do pięciu wariantów:</p><table class=\"table table-bordered\"><thead><tr><th scope=\"col\">Model</th><th scope=\"col\">Cena</th><th scope=\"col\">Procesor</th><th scope=\"col\">Karta graficzna</th><th scope=\"col\">Rodzaj matrycy</th></tr></thead><tbody><tr><th scope=\"row\">Dell G15</th><td>4699 zł</td><td>Intel i7</td><td>Nvidia RTX 3050</td><td>Matowa WVA</td></tr><tr><th scope=\"row\">Lenovo Yoga</th><td>4499 zł</td><td>Ryzen 7</td><td>Zintegrowana AMD</td><td>Błyszcząca OLED</td></tr><tr><th scope=\"row\">MSI Bravo</th><td>3299 zł</td><td>Ryzen 5</td><td>Radeon RX 6550M</td><td>Matowa IPS</td></tr><tr><th scope=\"row\">HP 250</th><td>2599 zł</td><td>Intel i5</th><td>Intel Iris Xe</td><td>Matowa VA</td></tr><tr><th scope=\"row\">MacBook Air</th><td>6099 zł</td><td>Apple M2</td><td>Zintegrowana Apple</td><td>Błyszcząca Liquid Retina</td></tr></tbody></table><p>Chciałbyś/abyś te warianty ocenić i uporządkować zgodnie z <b>poniższymi preferencjami</b>. Jeśli pojawi się kłopot z zakupem któregoś z wariantów będziesz wiedział/a który produkt wybrać w dalszej kolejności.</p><p>Najważniejsze kryterium pod względem wyboru konkretnego komputera stanowi moc obliczeniowa procesora. W tej kategorii najlepszym wyborem jest Intel i7. Ryzen 7 traci do niego około 15%, natomiast Apple M2 jest około 35% słabszy od Ryzena 7. Ryzen 5 jest jedynie marginalnie słabszy od Ryzena 7, natomiast Intel i5 traci do Ryzena Serii 7 20% wydajności.</p><p>Niemal równie istotna co procesor, jest karta graficzna. W tym wypadku niemal na równi stoją karty dedykowane RTX 3050 i RX 6550M z marginalną przewagą Radeona. Kolejny w zestawieniu jest układ zintegrowany AMD, który jest od nich o blisko 40% słabszy. Układ zintegrowany od Apple traci względem zintegrowanego AMD około 5% wydajności, natomiast najsłabszy w całym zestawieniu jest Intel Iris, którego wydajność jest o blisko połowę niższa niż wydajność karty zintegrowanej AMD.</p><p>Trzecim w kolejności kryterium decyzyjnym jest cena. Potrzebujesz tego laptopa do pracy i nauki, w związku z czym rodzice obiecali wesprzeć cię finansowo w tym zakupie i cena nie jest czynnikiem decydującym, niemniej jednak również jest bardzo istotna. I tutaj obowiązuje zasada im mniej, tym lepiej.</p><p>Najmniej istotny podczas wyboru sprzętu jest typ matrycy. Warto jednak pochylić się nad tym kryterium, gdyż właściwy dobór matrycy może mieć wpływ na komfort korzystania ze sprzętu. Matryce matowe wypadają w tej kwestii przeważnie lepiej, niż błyszczące. Jeżeli już musimy wybrać matrycę błyszczącą, to lepsza będzie Liquid Retina, gdyż może osiągać wyższą jasność i jest mniej podatna na przepalenia. W planowanych zastosowaniach matryca IPS sprawdzi się lepiej, niż VA ze względu na szersze kąty widzenia i wyższy kontrast, natomiast matryca WVA będzie minimalnie gorsza od IPS, gdyż jest jego bliskim odpowiednikiem.</p>",
      "description_preview": "Właśnie zepsuł się twój laptop, który wykorzystywałeś/aś do pracy na studiach. Naprawa okazuje się nieopłacalna, a więc podejmujesz decyzję o zakupie nowego sprzętu. Nowy laptop powinien służyć jak najdłużej, więc zakup musi być dobrze przemyślany.",
      "is_available": true,
      "group": 0
    }
  },
  {
    "model": "mcda.Problem",
    "pk": 2,
    "fields": {
      "name": "Samochód dla kolegi",
      "description": "<p>Po zdaniu egzaminu na prawo jazdy kolega poprosił cię o pomoc w wyborze swojego pierwszego samochodu. Niestety, ze względu na ograniczony budżet w grę wchodzą jedynie oferty aut używanych. Po krótkim przeglądzie portali aukcyjnych wytypowaliście pięć wartych zainteresowania ofert:</p><table class=\"table\"><thead><tr><th scope=\"col\">Model</th><th scope=\"col\">Cena</th><th scope=\"col\">Rodzaj paliwa</th><th scope=\"col\">Przebieg</th><th scope=\"col\">Rok produkcji</th></tr></thead><tbody><tr><th scope=\"row\">Fiat Panda</th><td>11000 zł</td><td>Diesel</td><td>199000 km</td><td>2008</td></tr><tr><th scope=\"row\">Ford Focus</th><td>12000 zł</td><td>Benzyna+LPG</td><td>220000 km</td><td>2006</td></tr><tr><th scope=\"row\">Peugeot 207 SW</th><td>12000 zł</td><td>Benzyna</td><td>199000 km</td><td>2009</td></tr><tr><th scope=\"row\">Honda Civic</th><td>14000 zł</td><td>Hybryda</th><td>297000 km</td><td>2006</td></tr><tr><th scope=\"row\">Nissan Leaf</th><td>17400 zł</td><td>Elektryk</td><td>142000 km</td><td>2013</td></tr></tbody></table><p>Chciałbyś/abyś uszeregować znalezione oferty pod względem preferencji kolegi, aby wiedzieć, które z nich rozpatrywać w dalszej kolejności razie problemów z zakupem.</p><p>Najważniejszym i wręcz decydującym kryterium dla Twojego kolegi jest cena - im niższa, tym lepiej. Jest on skłonny zapłacić za samochód mniej nawet kosztem tego, że potencjalnie będzie musiał oddać auto do warsztatu, w celu wykonania dodatkowych napraw.</p><p>Trochę mniej istotny, ale wciąż bardzo ważny jest rok produkcji. Auto powinno być jak najmłodsze.</p><p>Rodzaj paliwa jest, mniej więcej w połowie tak istotny, jak rok produkcji. Najlepiej byłoby, gdyby auto posiadało napęd hybrydowy. Trochę gorsze będzie auto z instalacją LPG. Samochód na benzynę będzie mniej więcej w 2/3 tak dobry, jak auto na gaz, a auto napędzane dieslem będzie trochę gorsze od auta benzynowego. Auto elektryczne, ze względu na duży wiek w tym przedziale cenowym i ryzyko konieczności wymiany baterii, powinno być traktowane raczej jako ostateczność.</p><p>Przebieg podany w ogłoszeniu również powinien być jak najniższy, ale też nie powinien w żaden sposób przekreślać samochodu. Z racji na powszechne praktyki cofania liczników, przebieg jest najmniej istotnym z parametrów i jest traktowany jedynie informacyjnie. Dużo istotniejszy będzie ogólny stan samochodu i stopień zużycia wnętrza podczas oględzin na miejscu.</p>",
      "description_preview": "Po zdaniu egzaminu na prawo jazdy kolega poprosił cię o pomoc w wyborze swojego pierwszego samochodu. Ograniczony budżet nie pozwala wam na zbyt wiele, ale po krótkich poszukiwaniach znaleźliście kilka okazów wartych zainteresowania.",
      "is_available": false,
      "group": 1
    }
  }
]
